Repository: Fjuro/passes
Catalog: po/*.po
Languages: it

source: Passes
it: Biglietti

source: A digital pass manager
it: Un gestore di biglietti digitali

source: Import and use your digital passes
it: Importa e usa i tuoi biglietti digitali

source: Passes is a tool that allows you to import and use your digital passes, such as boarding passes, coupons, loyalty cards, event tickets, etc.
it: Passes è uno strumento che ti permette di importare e utilizzare i tuoi biglietti digitali, come carte d'imbarco, coupon, carte fedeltà, biglietti per eventi, ecc.

source: Current features:
it: Funzionalità correnti:

source: Adaptive user interface.
it: Interfaccia utente adattiva.

source: Import espass and pkpass files.
it: Importa file espass e pkpass.

source: Display Aztec, CODE128, PDF417 and QR codes.
it: Display Aztec, CODE128, PDF417 e QR code.

source: What is new?
it: Cosa c'è di nuovo?

source: Initial support for esPass format.
it: Supporto iniziale per il formato esPass.

source: Dutch translation.
it: Traduzione olandese.

source: Italian translation.
it: Traduzione italiana.

source: Basque translation.
it: Traduzione in basco.

source: Support for CODE128 codes.
it: Supporto per codici CODE128.

source: What has been changed/improved?
it: "Cosa è stato cambiato/migliorato?

source: Pass information is now displayed inside a card/pass widget.
it: Le informazioni sul biglietto ora vengono visualizzate all'interno di un widget tessera/pass.

source: Updated version of application dependencies.
it: Versione aggiornata delle dipendenze dell'applicazione.

source: In pass list, pass icon is now rounded.
it: Nell'elenco dei biglietti, l'icona è ora arrotondata.

source: Spanish translation.
it: Traduzione in spagnolo

source: Default size of barcode dialogue.
it: Dimensione predefinita della finestra di dialogo del codice a barre.

source: Improved URL recognition inside back fields
it: Migliorato il riconoscimento dell'URL all'interno dei campi posteriori

source: Other minor improvements.
it: Altri miglioramenti minori.

source: What has been fixed?
it: Cosa è stato risolto?

source: Fixed how encoded strings are passed to the barcode library.
it: Corretto il modo in cui le stringhe codificate vengono passate alla libreria dei codici a barre.

source: Avoid adding links to back fields if they already have them.
it: Evita di aggiungere collegamenti ai campi posteriori se li hanno già.

source: Fixed shorcuts.
it: Corretto le scorciatoie.

source: Fixed drawing of passes without logo.
it: Corretto l'estrazione dei biglietti senza logo.

source: Other small fixes.
it: Altre piccole correzioni.

source: In pass list, pass description is now grayed out if the pass has expired.
it: Nell'elenco dei biglietti, la descrizione ora è disattivata se il biglietto è scaduto.

source: After application startup, the pass list will be shown (instead of automatically navigating to the first pass in the list).
it: Dopo l'avvio dell'applicazione, verrà mostrato l'elenco dei biglietti (invece di navigazione automatica al primo biglietto nell'elenco).

source: Removed unnecessary files and dependencies from the Flatpak container.
it: File e dipendenze non necessarie rimosse dal container Flatpak.

source: Code changes toward supporting other pass formats in the future.
it: Il codice cambia per supportare altri formati di biglietti in futuro.

source: Support for drawing PDF417 codes.
it: Supporto per il disegno di codici PDF417.

source: Pass list is now sorted by relevant date instead of style.
it: L'elenco dei biglietti è ora ordinato per data rilevante invece che per stile.

source: Pass fields were updated to be non-activatable.
it: I campi dei biglietti sono stati aggiornati per essere non attivabili.

source: Barcodes will not be drawn at a fixed size, but they will adapt to the available space.
it: I codici a barre non verranno disegnati con una dimensione fissa, ma si adatteranno al spazio disponibile.

source: Tooltips were added to the buttons that did not have them yet.
it: Le descrizioni comandi sono state aggiunte ai pulsanti che ancora non le avevano.

source: New features:
it: Nuove funzionalità:

source: Added support for Aztec codes.
it: Aggiunto il supporto per i codici aztechi.

source: Passes will now be recognized as mobile compatible by Phosh.
it: I biglietti saranno ora riconosciuti come compatibili con dispositivi mobili da Phosh.

source: Improvements:
it: Miglioramenti:

source: Replaced python3-qrcode with zint.
it: Sostituito python3-qrcode con zint.

source: Decreased memory consumption of instances of PKPass.
it: Diminuzione del consumo di memoria delle istanze di PKPass.

source: In pass list, increased spacing between cards and descriptions.
it: Nella lista dei biglietti, maggiore spaziatura tra schede e descrizioni.

source: Bug fixes:
it: Correzioni di bug:

source: Pass field rows can now be created even if their value is not text.
it: Le righe del campo del biglietto ora possono essere create anche se il loro valore non è testo.

source: Included website and description in About dialogue.
it: Sito Web e descrizione inclusi nella finestra di dialogo delle informazioni.

source: The selected pass will not be highlighted if the leaflet is folded.
it: Il bilgietto selezionato non sarà evidenziato se il foglio illustrativo è piegato.

source: Corrected margins and spaces between widgets.
it: Margini e spazi corretti tra i widget.

source: Moved pass description in the right pane from title bar to pass view.
it: Descrizione del biglietto spostata nel riquadro destro dalla barra del titolo alla vista biglietto.

source: Pass field rows can now wrap text if it is too long.
it: Le righe del campo del biglietto ora possono mandare a capo il testo se è troppo lungo.

source: Pass view now shows a bigger logo inside a colored row.
it: La vista del biglietto ora mostra un logo più grande all'interno di una riga colorata.

source: Capitalized application name in main menu.
it: Nome dell'applicazione in maiuscolo nel menu principale.

source: Fixed a bug when displaying standard fields that do not have a label.
it: Risolto un bug durante la visualizzazione di campi standard che non hanno un'etichetta.

source: Fixed import of passes with images that are not PNG.
it: Corretto l'importazione dei biglietti con immagini che non sono PNG.

source: Fixed import of passes with text files encoded in UTF-16.
it: Corretta l'importazione dei biglietti con file di testo codificati in UTF-16.

source: Fixed QR code icon color in dark mode.
it: Risolto il problema con il colore dell'icona del codice QR in modalità scura.

source: Fixed the background of the barcode dialogue in dark mode.
it: Risolto lo sfondo del dialogo del codice a barre in modalità scura.

source: Fix 'Add' icon.
it: Corretto l'icona 'Aggiungi'.

source: Hide Settings entry from primary menu.
it: Nascondi la voce impostazioni dal menu principale.

source: Initial release
it: Versione iniziale

source: Import a pass
it: Importa un biglietto

source: Supported passes
it: Biglietti supportati

source: All files
it: Tutti i file

source: Pass updated
it: Biglietto aggiornato

source: File is not a pass
it: Il file non è un biglietto

source: Format not supported yet
it: Formato non ancora supportato

source: Unknown file encoding
it: Sistema di codifica del file sconosciuto

source: Monday
it: Lunedì

source: Tuesday
it: Martedì

source: Wednesday
it: Mercoledì

source: Thursday
it: Giovedì

source: Friday
it: Venerdì

source: Saturday
it: Sabato

source: Sunday
it: Domenica

source: Today
it: Oggi

source: Tomorrow
it: Domani

source: Pass already updated
it: Biglietto già aggiornato

source: Pass not updatable
it: Biglietto non aggiornabile

source: Pass update error: {} {}
it: Errore di aggiornamento del biglietto: {} {}

source: File already imported
it: File già importato

source: Barcode format not supported
it: Formato del codice non supportato

source: You have no passes
it: Non hai biglietti

source: Use the “+” button to import a pass
it: Usa il tasto “+” per importare un biglietto

source: Without expiration date
it: Senza data di scadenza

source: No additional information
it: Nessuna informazione aggiuntiva

# shortcut window
source: General
it: Generale

# shortcut window
source: Show shortcuts
it: Mostra scorciatoie

# shortcut window
source: Quit
it: Esci

# shortcut window
source: Passes
it: Biglietti

# shortcut window
source: Import a pass
it: Importa un biglietto

# shortcut window
source: Update selected pass
it: Aggiorna biglietto selezionato

source: Menu
it: Menù

source: Back
it: Indietro

source: Show additional information
it: Mostra informazioni aggiuntive

source: Update pass
it: Aggiorna biglietto

source: Show barcode
it: Mostra codice

source: Keyboard shortcuts
it: Scorciatoie da tastiera

source: About Passes
it: Informazioni

source: Delete
it: Elimina
